runs/stateful/full_paper/exp5_throughput_overhead_mistral_sglang/sglang_runs/mistralai_Mistral-7B-Instruct-v0.3/ctx1024_out64_a16_b4_s0/sglang_bench_raw.txt
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=44005, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='mistralai/Mistral-7B-Instruct-v0.3', served_model_name=None, tokenizer='mistralai/Mistral-7B-Instruct-v0.3', num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=64, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:44005/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=44005, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='mistralai/Mistral-7B-Instruct-v0.3', served_model_name=None, tokenizer='mistralai/Mistral-7B-Instruct-v0.3', num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=64, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 17076
#Output tokens: 954
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 not set   
Successful requests:                     32        
Benchmark duration (s):                  1.15      
Total input tokens:                      17076     
Total input text tokens:                 17076     
Total generated tokens:                  954       
Total generated tokens (retokenized):    959       
Request throughput (req/s):              27.82     
Input token throughput (tok/s):          14845.38  
Output token throughput (tok/s):         829.38    
Peak output token throughput (tok/s):    841.00    
Peak concurrent requests:                32        
Total token throughput (tok/s):          15674.76  
Concurrency:                             24.57     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   883.24    
Median E2E Latency (ms):                 854.76    
P90 E2E Latency (ms):                    1095.45   
P99 E2E Latency (ms):                    1132.20   
---------------Time to First Token----------------
Mean TTFT (ms):                          534.07    
Median TTFT (ms):                        526.60    
P99 TTFT (ms):                           666.89    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          17.21     
Median TPOT (ms):                        9.85      
P99 TPOT (ms):                           113.73    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           12.12     
Median ITL (ms):                         7.74      
P95 ITL (ms):                            8.82      
P99 ITL (ms):                            148.13    
Max ITL (ms):                            592.84    
==================================================


  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [00:00<00:16,  1.89it/s]
  6%|▋         | 2/32 [00:00<00:09,  3.28it/s]
 38%|███▊      | 12/32 [00:00<00:00, 22.76it/s]
 59%|█████▉    | 19/32 [00:00<00:00, 33.39it/s]
 78%|███████▊  | 25/32 [00:01<00:00, 36.59it/s]
100%|██████████| 32/32 [00:01<00:00, 28.09it/s]